# YOLOv11n with GhostConv Backbone
# Lightweight variant for DigiSteel-YOLO robustness study
#
# GhostConv replaces standard Conv2d with Ghost convolution (Han et al., CVPR 2020)
# This reduces parameters by ~50% while maintaining similar accuracy.
#
# Reference: https://github.com/huawei-noah/Efficient-AI-Backbones

# Parameters
nc: 6  # number of classes (NEU-DET)
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]  # YOLO11n summary: 181 layers, 1,873,792 params, 4.3 GFLOPs

# Backbone with GhostConv
backbone:
  - [-1, 1, GhostConv, [64, 3, 2]]    # 0-P1/2
  - [-1, 1, GhostConv, [128, 3, 2]]   # 1-P2/4
  - [-1, 1, C2f, [128, True]]
  - [-1, 1, GhostConv, [256, 3, 2]]   # 3-P3/8
  - [-1, 1, C2f, [256, True]]
  - [-1, 1, GhostConv, [512, 3, 2]]   # 5-P4/16
  - [-1, 1, C2f, [512, True]]
  - [-1, 1, GhostConv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 1, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 1, C2f, [512]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 1, C2f, [256]]
  - [-1, 1, GhostConv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 1, C2f, [512]]
  - [-1, 1, GhostConv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 1, C2f, [1024]]

# Head
head:
  - [[15, 18, 21], 1, Detect, [nc]]
